# Taps
tap 'aws/tap'
tap 'bufbuild/buf'
tap 'cloudflare/cloudflare'
tap 'dagger/tap'
tap 'depot/tap'
tap 'github/gh'
tap 'golangci/tap'
tap 'hashicorp/tap'
tap 'jacobwgillespie/tap'
tap 'nats-io/nats-tools'
tap 'oven-sh/bun'
tap 'peak/tap'
tap 'planetscale/tap'
tap 'restatedev/tap'
tap 'rwx-research/tap'
tap 'sst/tap'

# Formulae
brew 'ack'
brew 'aws-vault'
brew 'awscli'
brew 'awsdac'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bazel'
brew 'bchunk'
brew 'biome'
brew 'buf'
brew 'buildkit'
brew 'ccache'
brew 'chamber'
brew 'cloudflared'
brew 'cmake'
brew 'coreutils'
brew 'crane'
brew 'deno'
brew 'diffutils'
brew 'dive'
brew 'duckdb'
brew 'entr'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fio'
brew 'flyctl'
brew 'fswatch'
brew 'fzf'
brew 'gemini-cli'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-filter-repo'
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'
brew 'gotestsum'
brew 'gping'
brew 'graphviz'
brew 'grc'
brew 'grep'
brew 'hadolint'
brew 'hex'
brew 'httpie'
brew 'htop'
brew 'kubectx'
brew 'kustomize'
brew 'hyperfine'
brew 'imagemagick'
brew 'jj'
brew 'jjui'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'librsvg'
brew 'libssh2'
brew 'logcli'
brew 'massren'
brew 'media-info'
brew 'mise'
brew 'mtr'
brew 'mysql-client@8.4'
brew 'nmap'
brew 'node'
brew 'openssh'
brew 'oras'
brew 'packer'
brew 'pkg-config'
brew 'plantuml'
brew 'pnpm'
brew 'postgresql@14'
brew 'protobuf'
brew 'protoc-gen-go'
brew 'protoc-gen-go-grpc'
brew 'rbenv'
brew 'rclone'
brew 'redis'
brew 'ripgrep'
brew 'ruff'
brew 'rustup'
brew 'sccache'
brew 'shellcheck'
brew 'shfmt'
brew 'skopeo'
brew 'socat'
brew 'starship'
brew 'subversion'
brew 'sqlc'
brew 'telnet'
brew 'temporal'
brew 'terraform-docs'
brew 'tflint'
brew 'tokei'
brew 'uv'
brew 'wget'
brew 'wrk'
brew 'xh'
brew 'yarn'
brew 'yazi'
brew 'yq'
brew 'yt-dlp'
brew 'zig'
brew 'zola'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

brew 'dagger/tap/dagger'
brew 'depot/tap/depot'
brew 'jacobwgillespie/tap/git-sync'
brew 'jacobwgillespie/tap/run'
brew 'nats-io/nats-tools/nats'
brew 'oven-sh/bun/bun'
brew 'peak/tap/s5cmd'
brew 'planetscale/tap/pscale'
brew 'restatedev/tap/restate'
brew 'restatedev/tap/restatectl'
brew 'rwx-research/tap/mint'
brew 'sst/tap/opencode'
brew 'turbot/tap/powerpipe'
brew 'turbot/tap/steampipe'

# Only install on macOS
if /darwin/ =~ RUBY_PLATFORM
  # Formulae
  brew 'imessage-exporter'
  brew 'lima'
  brew 'mas'

  # Casks
  cask '1password'
  cask '1password-cli'
  cask 'affinity-designer'
  cask 'affinity-photo'
  cask 'affinity-publisher'
  cask 'amazon-chime'
  cask 'araxis-merge'
  cask 'arq'
  cask 'balenaetcher'
  cask 'battery'
  cask 'bettertouchtool'
  cask 'blitz'
  cask 'chatgpt'
  cask 'claude'
  cask 'claude-code'
  cask 'cleanmymac'
  cask 'cloudflare-warp'
  cask 'conductor'
  cask 'cursor'
  cask 'daisydisk'
  cask 'dash'
  cask 'discord'
  cask 'docker-desktop'
  cask 'dynobase'
  cask 'elgato-camera-hub'
  cask 'elgato-control-center'
  cask 'elgato-stream-deck'
  cask 'firefox'
  cask 'focusrite-control'
  cask 'gg'
  cask 'ghostty'
  cask 'github'
  cask 'google-chrome'
  cask 'google-cloud-sdk'
  cask 'granola'
  cask 'handbrake'
  cask 'iina'
  cask 'imageoptim'
  cask 'kaleidoscope'
  cask 'kap'
  cask 'league-of-legends'
  cask 'linearmouse'
  cask 'linear-linear'
  cask 'makemkv'
  cask 'microsoft-auto-update'
  cask 'mimestream'
  cask 'ngrok'
  cask 'nosql-workbench'
  cask 'notion'
  cask 'notion-calendar'
  cask 'notion-mail'
  cask 'oracle-jdk'
  cask 'pingplotter'
  cask 'plex'
  cask 'proxyman'
  cask 'raycast'
  cask 'replacicon'
  cask 'retcon'
  cask 'session-manager-plugin'
  cask 'shottr'
  cask 'slack'
  cask 'sonos'
  cask 'sony-ps-remote-play'
  cask 'spotify'
  cask 'steam'
  cask 'sublime-text'
  cask 'superwhisper'
  cask 'tableplus'
  cask 'tailscale'
  cask 'tower'
  cask 'transmission'
  cask 'unite'
  cask 'vlc'
  cask 'whatsapp@beta'
  cask 'wireshark'
  cask 'yaak'
  cask 'zed'
  cask 'zoom'

  # Fonts
  cask 'font-fira-code'
  cask 'font-hasklig'
  cask 'font-inter'
  cask 'font-iosevka'
  cask 'font-jetbrains-mono'
  cask 'font-outfit'
  cask 'font-red-hat-display'
  cask 'font-red-hat-mono'
  cask 'font-red-hat-text'
  cask 'font-source-code-pro'

  # Mac App Store Applications
  mas 'Balatro+', id: 6502451661
  mas 'Dato', id: 1470584107
  mas 'Flighty', id: 1358823008
  mas 'Infuse', id: 1136220934
  mas 'Ivory for Mastodon', id: 6444602274
  mas 'Microsoft Excel', id: 462058435
  mas 'Microsoft Remote Desktop 10', id: 1295203466
  mas 'Microsoft Word', id: 462054704
  mas 'Pixelmator Pro', id: 1289583905
  mas 'Poolside FM', id: 1514817810
  mas 'Reeder 5', id: 1529448980
  mas 'Refined GitHub', id: 1519867270
  mas 'Simplify for Gmail', id: 1544668450
  mas 'Ulysses', id: 1225570693
  mas 'uBlock Origin Lite', id: 6745342698
  mas 'Xcode', id: 497799835

  # Cursor extensions
  vscode 'anthropic.claude-code'
  vscode 'anysphere.cursorpyright'
  vscode 'astro-build.astro-vscode'
  vscode 'biomejs.biome'
  vscode 'bradlc.vscode-tailwindcss'
  vscode 'bufbuild.vscode-buf'
  vscode 'charliermarsh.ruff'
  vscode 'deerawan.vscode-dash'
  vscode 'esbenp.prettier-vscode'
  vscode 'GitHub.github-vscode-theme'
  vscode 'github.vscode-github-actions'
  vscode 'golang.go'
  vscode 'hangxingliu.vscode-systemd-support'
  vscode 'hashicorp.hcl'
  vscode 'hashicorp.terraform'
  vscode 'hediet.vscode-drawio'
  vscode 'jacobwgillespie.minimal-icons'
  vscode 'jakearl.search-editor-apply-changes'
  vscode 'jebbs.plantuml'
  vscode 'jjk.jjk'
  vscode 'ms-python.debugpy'
  vscode 'ms-python.python'
  vscode 'ms-python.vscode-pylance'
  vscode 'oven.bun-vscode'
  vscode 'redhat.vscode-yaml'
  vscode 'rust-lang.rust-analyzer'
  vscode 'tamasfe.even-better-toml'
  vscode 'unifiedjs.vscode-mdx'
  vscode 'usernamehw.errorlens'
  vscode 'wayou.vscode-todo-highlight'
  vscode 'YoavBls.pretty-ts-errors'

  USING_VSCODE = false
  if USING_VSCODE then
    vscode 'github.codespaces'
    vscode 'github.copilot-chat'
    vscode 'github.copilot'
    vscode 'github.vscode-pull-request-github'
    vscode 'ms-azuretools.vscode-containers'
    vscode 'ms-azuretools.vscode-docker'
    vscode 'ms-python.vscode-python-envs'
    vscode 'ms-vscode-remote.remote-containers'
    vscode 'ms-vscode-remote.remote-ssh-edit'
    vscode 'ms-vscode-remote.remote-ssh'
    vscode 'ms-vscode.cpptools'
    vscode 'ms-vscode.remote-explorer'
    vscode 'ms-vsliveshare.vsliveshare'
    vscode 'visualstudioexptteam.vscodeintellicode'
  end
end

# Only install on Linux
if /linux/ =~ RUBY_PLATFORM
  # Formulae
  brew 'gcc'
end
