# Taps
tap 'aws/tap'
tap 'bufbuild/buf'
tap 'cloudflare/cloudflare'
tap 'dagger/tap'
tap 'depot/tap'
tap 'github/gh'
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'jacobwgillespie/tap'
tap 'jakehilborn/jakehilborn'
tap 'oven-sh/bun'
tap 'peak/tap'
tap 'planetscale/tap'
tap 'pulumi/tap'
tap 'rwx-research/tap'

# Formulae
brew 'ack'
brew 'asdf'
brew 'aws-vault'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bazel'
brew 'bchunk'
brew 'buf'
brew 'buildkit'
brew 'ccache'
brew 'cloudflared'
brew 'cmake'
brew 'coreutils'
brew 'crane'
brew 'deno'
brew 'diffutils'
brew 'dive'
brew 'entr'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fio'
brew 'flyctl'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-filter-repo'
brew 'gnupg'
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'
brew 'gping'
brew 'graphviz'
brew 'grc'
brew 'grep'
brew 'hadolint'
brew 'hex'
brew 'hey'
brew 'httpie'
brew 'htop'
brew 'kubectx'
brew 'kustomize'
brew 'hyperfine'
brew 'imagemagick'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'librsvg'
brew 'libssh2'
brew 'massren'
brew 'media-info'
brew 'mtr'
brew 'mysql-client@8.4'
brew 'n'
brew 'nmap'
brew 'node'
brew 'openssh'
brew 'oras'
brew 'packer'
brew 'postgresql@14'
brew 'pkg-config'
brew 'pnpm'
brew 'protobuf'
brew 'protoc-gen-go'
brew 'protoc-gen-go-grpc'
brew 'rbenv'
brew 'rclone'
brew 'redis'
brew 'ripgrep'
brew 'ruff'
brew 'rustup'
brew 'sccache'
brew 'shellcheck'
brew 'shfmt'
brew 'skopeo'
brew 'socat'
brew 'starship'
brew 'subversion'
brew 'telnet'
brew 'temporal'
brew 'terraform-docs'
brew 'tflint'
brew 'tokei'
brew 'uv'
brew 'wget'
brew 'wrk'
brew 'xh'
brew 'yarn'
brew 'yazi'
brew 'yq'
brew 'yt-dlp'
brew 'zola'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

brew 'dagger/tap/dagger'
brew 'depot/tap/depot'
brew 'jacobwgillespie/tap/git-sync'
brew 'jacobwgillespie/tap/run'
brew 'jacobwgillespie/tap/tf-shim'
brew 'oven-sh/bun/bun'
brew 'planetscale/tap/pscale'
brew 'pulumi/tap/pulumi'
brew 'pulumi/tap/pulumictl'
brew 'rwx-research/tap/mint'
brew 'peak/tap/s5cmd'

# Only install on macOS
if /darwin/ =~ RUBY_PLATFORM
  # Formulae
  brew 'lima'
  brew 'mas'
  brew 'pinentry-mac'

  brew 'jakehilborn/jakehilborn/displayplacer'

  # Casks
  cask '1password-cli'
  cask '1password'
  cask 'ableton-live-intro'
  cask 'affinity-designer'
  cask 'affinity-photo'
  cask 'affinity-publisher'
  cask 'amazon-chime'
  cask 'arc'
  cask 'arq'
  cask 'audio-hijack'
  cask 'balenaetcher'
  cask 'battery'
  cask 'bettertouchtool'
  cask 'blitz'
  cask 'chatgpt'
  cask 'cleanmymac'
  cask 'clickhouse'
  cask 'cloudflare-warp'
  cask 'daisydisk'
  cask 'dash'
  cask 'dbngin'
  cask 'discord'
  cask 'docker'
  cask 'dynobase'
  cask 'elgato-camera-hub'
  cask 'elgato-control-center'
  cask 'elgato-stream-deck'
  cask 'figma'
  cask 'firefox'
  cask 'focusrite-control'
  cask 'front'
  cask 'ghostty'
  cask 'github'
  cask 'google-chrome'
  cask 'google-cloud-sdk'
  cask 'handbrake'
  cask 'iina'
  cask 'imageoptim'
  cask 'insomnia'
  cask 'iterm2'
  cask 'kaleidoscope'
  cask 'kap'
  cask 'league-of-legends'
  cask 'lens'
  cask 'linearmouse'
  cask 'linear-linear'
  cask 'loopback'
  cask 'makemkv'
  cask 'meta'
  cask 'microsoft-auto-update'
  cask 'microsoft-edge'
  cask 'mullvadvpn'
  cask 'ngrok'
  cask 'nosql-workbench'
  cask 'notion'
  cask 'notion-calendar'
  cask 'obs'
  cask 'oracle-jdk'
  cask 'orion'
  cask 'pingplotter'
  cask 'plex'
  cask 'proxyman'
  cask 'raycast'
  cask 'session-manager-plugin'
  cask 'shottr'
  cask 'slack'
  cask 'sonos'
  cask 'sony-ps-remote-play'
  cask 'soundsource'
  cask 'spotify'
  cask 'steam'
  cask 'sublime-text'
  cask 'superhuman'
  cask 'tableplus'
  cask 'tailscale'
  cask 'transmission'
  cask 'transmit'
  cask 'unite'
  cask 'visual-studio-code'
  cask 'vlc'
  cask 'whatsapp@beta'
  cask 'wireshark'
  cask 'yaak'
  cask 'zoom'

  # Fonts
  cask 'font-fira-code'
  cask 'font-hasklig'
  cask 'font-inter'
  cask 'font-iosevka'
  cask 'font-jetbrains-mono'
  cask 'font-office-code-pro'
  cask 'font-outfit'
  cask 'font-red-hat-display'
  cask 'font-red-hat-mono'
  cask 'font-red-hat-text'
  cask 'font-source-code-pro'

  # Mac App Store Applications
  mas '1Blocker', id: 1365531024
  mas 'Dato', id: 1470584107
  mas 'Flighty', id: 1358823008
  mas 'Infuse', id: 1136220934
  mas 'Lungo', id: 1263070803
  mas 'Microsoft Excel', id: 462058435
  mas 'Microsoft Remote Desktop 10', id: 1295203466
  mas 'Microsoft Word', id: 462054704
  mas 'Pixelmator Pro', id: 1289583905
  mas 'Poolside FM', id: 1514817810
  mas 'Reeder 5', id: 1529448980
  mas 'Refined GitHub', id: 1519867270
  mas 'Simplified for Twitter', id: 1479307973
  mas 'Simplify for Gmail', id: 1544668450
  mas 'Ulysses', id: 1225570693
  mas 'WireGuard', id: 1451685025
  mas 'Xcode', id: 497799835

  # VS Code extensions
  vscode 'afzalsayed96.icones'
  vscode 'astro-build.astro-vscode'
  vscode 'bierner.color-info'
  vscode 'bradlc.vscode-tailwindcss'
  vscode 'bufbuild.vscode-buf'
  vscode 'charliermarsh.ruff'
  vscode 'dbaeumer.vscode-eslint'
  vscode 'deerawan.vscode-dash'
  vscode 'drcika.apc-extension'
  vscode 'EditorConfig.EditorConfig'
  vscode 'emeraldwalk.RunOnSave'
  vscode 'esbenp.prettier-vscode'
  vscode 'fredwangwang.vscode-hcl-format'
  vscode 'GitHub.codespaces'
  vscode 'GitHub.copilot'
  vscode 'GitHub.copilot-chat'
  vscode 'GitHub.github-vscode-theme'
  vscode 'github.vscode-github-actions'
  vscode 'GitHub.vscode-pull-request-github'
  vscode 'golang.go'
  vscode 'hangxingliu.vscode-systemd-support'
  vscode 'hashicorp.hcl'
  vscode 'hashicorp.terraform'
  vscode 'jacobwgillespie.minimal-icons'
  vscode 'jakearl.search-editor-apply-changes'
  vscode 'jdinhlife.gruvbox'
  vscode 'jtr.vscode-position'
  vscode 'joshferge.clickhouse-query-formatter'
  vscode 'mikestead.dotenv'
  vscode 'mindaro-dev.file-downloader'
  vscode 'ms-azuretools.vscode-docker'
  vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
  vscode 'ms-playwright.playwright'
  vscode 'ms-python.debugpy'
  vscode 'ms-python.python'
  vscode 'ms-python.vscode-pylance'
  vscode 'ms-vscode-remote.remote-containers'
  vscode 'ms-vscode-remote.remote-ssh'
  vscode 'ms-vscode-remote.remote-ssh-edit'
  vscode 'ms-vscode.cpptools'
  vscode 'ms-vscode.remote-explorer'
  vscode 'ms-vscode.vscode-js-profile-flame'
  vscode 'ms-vsliveshare.vsliveshare'
  vscode 'pbkit.vscode-pbkit'
  vscode 'redhat.vscode-commons'
  vscode 'redhat.vscode-xml'
  vscode 'redhat.vscode-yaml'
  vscode 'renesaarsoo.sql-formatter-vsc'
  vscode 'rust-lang.rust-analyzer'
  vscode 'Shopify.ruby-lsp'
  vscode 'sswg.swift-lang'
  vscode 'streetsidesoftware.code-spell-checker'
  vscode 'tamasfe.even-better-toml'
  vscode 'temporal-technologies.temporalio'
  vscode 'unifiedjs.vscode-mdx'
  vscode 'usernamehw.errorlens'
  vscode 'vadimcn.vscode-lldb'
  vscode 'VisualStudioExptTeam.vscodeintellicode'
  vscode 'wayou.vscode-todo-highlight'
  vscode 'YoavBls.pretty-ts-errors'
end

# Only install on Linux
if /linux/ =~ RUBY_PLATFORM
  # Formulae
  brew 'gcc'
end
