# Taps
tap 'ariga/tap'
tap 'aws/tap'
tap 'bufbuild/buf'
tap 'cloudflare/cloudflare'
tap 'depot/tap'
tap 'github/gh'
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'jacobwgillespie/tap'
tap 'jakehilborn/jakehilborn'
tap 'oven-sh/bun'
tap 'planetscale/tap'
tap 'superfly/tap'
tap 'yt-dlp/taps'

# Formulae
brew 'ack'
brew 'asdf'
brew 'atlas'
brew 'aws-vault'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bchunk'
brew 'buf'
brew 'buildkit'
brew 'ccache'
brew 'cmake'
brew 'coreutils'
brew 'crane'
brew 'deno'
brew 'depot'
brew 'diffutils'
brew 'dive'
brew 'entr'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'flyctl'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-filter-repo'
brew 'jacobwgillespie/tap/git-sync'
brew 'gnupg'
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'
brew 'gping'
brew 'graphviz'
brew 'grc'
brew 'grep'
brew 'hadolint'
brew 'hex'
brew 'hey'
brew 'httpie'
brew 'htop'
brew 'hyperfine'
brew 'imagemagick'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'librsvg'
brew 'libssh2'
brew 'llvm'
brew 'massren'
brew 'media-info'
brew 'mtr'
brew 'mysql-client'
brew 'n'
brew 'nmap'
brew 'node'
brew 'openssh'
brew 'oven-sh/bun/bun'
brew 'packer'
brew 'postgresql@14'
brew 'pkg-config'
brew 'pnpm'
brew 'protobuf'
brew 'protoc-gen-go'
brew 'protoc-gen-go-grpc'
brew 'pscale'
brew 'qemu'
brew 'qrencode'
brew 'rbenv'
brew 'rclone'
brew 'redis'
brew 'ripgrep'
brew 'run'
brew 'rustup-init'
brew 'sccache'
brew 'shellcheck'
brew 'shfmt'
brew 'skopeo'
brew 'socat'
brew 'starship'
brew 'subversion'
brew 'telnet'
brew 'temporal'
brew 'terraform-docs'
brew 'tflint'
brew 'tf-shim'
brew 'tokei'
brew 'wget'
brew 'wrk'
brew 'xh'
brew 'yarn'
brew 'yt-dlp'
brew 'zola'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Only install on macOS
if /darwin/ =~ RUBY_PLATFORM
  # Formulae
  brew 'displayplacer'
  brew 'lima'
  brew 'mas'
  brew 'pinentry-mac'

  # Casks
  cask '1password-cli'
  cask '1password'
  cask 'ableton-live-intro'
  cask 'affinity-designer'
  cask 'affinity-photo'
  cask 'affinity-publisher'
  cask 'amie'
  cask 'arc'
  cask 'arq'
  cask 'audio-hijack'
  cask 'balenaetcher'
  cask 'betterdisplay'
  cask 'bettertouchtool'
  cask 'blitz'
  cask 'cleanmymac'
  cask 'cloudflare-warp'
  cask 'cron'
  cask 'daisydisk'
  cask 'dash'
  cask 'dbngin'
  cask 'discord'
  cask 'discord-ptb'
  cask 'docker'
  cask 'elgato-camera-hub'
  cask 'elgato-control-center'
  cask 'elgato-stream-deck'
  cask 'figma'
  cask 'firefox'
  cask 'focusrite-control'
  cask 'front'
  cask 'github'
  cask 'google-chrome'
  cask 'google-cloud-sdk'
  cask 'handbrake'
  cask 'iconjar'
  cask 'iina'
  cask 'imageoptim'
  cask 'insomnia'
  cask 'iterm2'
  cask 'kaleidoscope'
  cask 'kap'
  cask 'league-of-legends'
  cask 'linearmouse'
  cask 'linear-linear'
  cask 'logitech-g-hub'
  cask 'loopback'
  cask 'makemkv'
  cask 'meta'
  cask 'microsoft-auto-update'
  cask 'microsoft-edge'
  cask 'minecraft'
  cask 'mullvadvpn'
  cask 'notion'
  cask 'now-tv-player'
  cask 'obs'
  cask 'openphone'
  cask 'oracle-jdk'
  cask 'orion'
  cask 'oso-cloud'
  cask 'pingplotter'
  cask 'plex'
  cask 'proxyman'
  cask 'raycast'
  cask 'screens'
  cask 'session-manager-plugin'
  cask 'shottr'
  cask 'slack'
  cask 'sonos'
  cask 'sony-ps-remote-play'
  cask 'soundsource'
  cask 'spacedrive'
  cask 'spotify'
  cask 'steam'
  cask 'sublime-text'
  cask 'tableplus'
  cask 'tailscale'
  cask 'transmission'
  cask 'transmit'
  cask 'unite'
  cask 'visual-studio-code'
  cask 'vlc'
  cask 'whatsapp-beta'
  cask 'wireshark'
  cask 'zoom'

  # Fonts
  cask 'font-fira-code'
  cask 'font-hasklig'
  cask 'font-inter'
  cask 'font-iosevka'
  cask 'font-jetbrains-mono'
  cask 'font-office-code-pro'
  cask 'font-outfit'
  cask 'font-red-hat-display'
  cask 'font-red-hat-mono'
  cask 'font-red-hat-text'
  cask 'font-source-code-pro'

  # Mac App Store Applications
  mas '1Blocker', id: 1365531024
  mas 'Camera Preview', id: 1632827132
  mas 'Dato', id: 1470584107
  mas 'Endel', id: 1484348796
  mas 'Flighty', id: 1358823008
  mas 'Infuse', id: 1136220934
  mas 'Jiffy', id: 1502527999
  mas 'Lungo', id: 1263070803
  mas 'Microsoft Excel', id: 462058435
  mas 'Microsoft Remote Desktop 10', id: 1295203466
  mas 'Microsoft Word', id: 462054704
  mas 'Pixelmator Pro', id: 1289583905
  mas 'Poolside FM', id: 1514817810
  mas 'Reeder 5', id: 1529448980
  mas 'Refined GitHub', id: 1519867270
  mas 'Simplified for Twitter', id: 1479307973
  mas 'Simplify for Gmail', id: 1544668450
  mas 'Tailscale', id: 1475387142
  mas 'Tweetbot', id: 1384080005
  mas 'Ulysses', id: 1225570693
  mas 'WireGuard', id: 1451685025
  mas 'Xcode', id: 497799835

  # VS Code extensions
  vscode "afzalsayed96.icones"
  vscode "Ariga.atlas-hcl"
  vscode "astro-build.astro-vscode"
  vscode "bierner.color-info"
  vscode "bradlc.vscode-tailwindcss"
  vscode "bufbuild.vscode-buf"
  vscode "dbaeumer.vscode-eslint"
  vscode "deerawan.vscode-dash"
  vscode "drcika.apc-extension"
  vscode "EditorConfig.EditorConfig"
  vscode "emeraldwalk.RunOnSave"
  vscode "esbenp.prettier-vscode"
  vscode "fredwangwang.vscode-hcl-format"
  vscode "GitHub.codespaces"
  vscode "GitHub.copilot"
  vscode "GitHub.copilot-chat"
  vscode "GitHub.github-vscode-theme"
  vscode "github.vscode-github-actions"
  vscode "GitHub.vscode-pull-request-github"
  vscode "golang.go"
  vscode "hashicorp.hcl"
  vscode "hashicorp.terraform"
  vscode "inferrinizzard.prettier-sql-vscode"
  vscode "jacobwgillespie.minimal-icons"
  vscode "jakearl.search-editor-apply-changes"
  vscode "jdinhlife.gruvbox"
  vscode "jtr.vscode-position"
  vscode "mikestead.dotenv"
  vscode "mindaro-dev.file-downloader"
  vscode "ms-azuretools.vscode-docker"
  vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
  vscode "ms-playwright.playwright"
  vscode "ms-vscode-remote.remote-containers"
  vscode "ms-vscode-remote.remote-ssh"
  vscode "ms-vscode-remote.remote-ssh-edit"
  vscode "ms-vscode.cpptools"
  vscode "ms-vscode.remote-explorer"
  vscode "ms-vscode.vscode-js-profile-flame"
  vscode "ms-vsliveshare.vsliveshare"
  vscode "pbkit.vscode-pbkit"
  vscode "redhat.vscode-commons"
  vscode "redhat.vscode-xml"
  vscode "redhat.vscode-yaml"
  vscode "rust-lang.rust-analyzer"
  vscode "Shopify.ruby-lsp"
  vscode "sourcegraph.cody-ai"
  vscode "sswg.swift-lang"
  vscode "streetsidesoftware.code-spell-checker"
  vscode "tamasfe.even-better-toml"
  vscode "temporal-technologies.temporalio"
  vscode "unifiedjs.vscode-mdx"
  vscode "usernamehw.errorlens"
  vscode "vadimcn.vscode-lldb"
  vscode "VisualStudioExptTeam.vscodeintellicode"
  vscode "wayou.vscode-todo-highlight"
  vscode "YoavBls.pretty-ts-errors"
end

# Only install on Linux
if /linux/ =~ RUBY_PLATFORM
  # Formulae
  brew 'gcc'
end
